In [1]:
import pandas as pd

In [15]:
data = {
    'Name':['Pandy','Bamboo','Fuzzy'],
    'Age':[5,7,4],
    'Bamboo_Sticks':[15,16,20]
}
df = pd.DataFrame(data)

In [3]:
print(df)

     Name  Age  Bamboo_Sticks
0   Pandy    5             15
1  Bamboo    7             16
2   Fuzzy    4             20

In [4]:
df

     Name  Age  Bamboo_Sticks
0   Pandy    5             15
1  Bamboo    7             16
2   Fuzzy    4             20

In [16]:
df.head()

     Name  Age  Bamboo_Sticks
0   Pandy    5             15
1  Bamboo    7             16
2   Fuzzy    4             20

In [6]:
df[df['Age']<6]

    Name  Age  Bamboo_Sticks
0  Pandy    5             15
2  Fuzzy    4             20

In [17]:
df['Job'] =['Intern','Manager','Intern']
print(df)

     Name  Age  Bamboo_Sticks      Job
0   Pandy    5             15   Intern
1  Bamboo    7             16  Manager
2   Fuzzy    4             20   Intern

In [8]:
df.loc[df['Name']=='Pandy','Age']=6
print(df)

     Name  Age  Bamboo_Sticks      Job
0   Pandy    6             15   Intern
1  Bamboo    7             16  Manager
2   Fuzzy    4             20   Intern

In [13]:
df=df.drop(columns=['Bamboo_Sticks','Age'])

In [14]:
print(df)

     Name      Job
0   Pandy   Intern
1  Bamboo  Manager
2   Fuzzy   Intern

In [18]:
df.iloc[0]

Name              Pandy
Age                   5
Bamboo_Sticks        15
Job              Intern
Name: 0, dtype: object

In [20]:
df["Age"]

0    5
1    7
2    4
Name: Age, dtype: int64

In [21]:
df.iloc[0:2, 1:3]

   Age  Bamboo_Sticks
0    5             15
1    7             16

In [24]:
df=pd.DataFrame({
    'Name' : ['Pandy','Bamboo','Fuzzy',"Fluffy"],
    'Age' : [5,7,4,6],
    'Bamboo_Sticks' : [15,16,20,18]
} index = ['a','b','c','d'])

SyntaxError: invalid syntax. Perhaps you forgot a comma? (3639225788.py, line 1)

In [26]:
df_flight=pd.read('"C:/Users/munta/Desktop/flights-larger.csv"')

AttributeError: module 'pandas' has no attribute 'read'